Revit 2024 API
DocumentSaveToLocalProgressChangedEventArgs Class
 The event arguments used during the save to local phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public class DocumentSaveToLocalProgressChangedEventArgs : WorksharedOperationProgressChangedEventArgs
Visual Basic
Public Class DocumentSaveToLocalProgressChangedEventArgs _
	Inherits WorksharedOperationProgressChangedEventArgs
Visual C++
public ref class DocumentSaveToLocalProgressChangedEventArgs : public WorksharedOperationProgressChangedEventArgs
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentSaveToLocalProgessChangedEventArgs' released since 2017 Subscription Update.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs
See Also
DocumentSaveToLocalProgressChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace